{"about":{"title":"about","body":"<h1>About</h1>\n<p>I'm Alice - I'm a (mostly) frontend engineer with a wide range of\ninterests in software things. I like cryptography, functional programming,\nfiddling with JS frameworks, Linux, tiling window managers, vim, and other\nnerdy stuff :).</p>\n<p>I built this site to replace a Jekyll blog, because I wanted to build\na React based single-page app (mostly for fun) which would replicate all\nof the functionality of Jekyll.</p>\n<p>Blog posts and some of the pages are written in Markdown, with a series of\nbuild scripts to turn a directory of Markdown files into JSON, which is\nincluded in the ReactJS app via webpack. I'm using\n<a href=\"https://github.com/alansouzati/react-router-to-array\">react-router-to-array</a>\nand node.js to write static files for a sort of pseudo-isomorphic server\nside routing. These static files are then deployed to <code>gh-pages</code>.</p>\n<p>The app itself is ReactJS, redux, react-router, and some functional libs\n(like Ramda and Sanctuary). The layout and styling for the site is built\nfrom the ground up with just plain SCSS.</p>\n<p>The app is also serving as a kind of monorepo - I have a couple projects\nwhich live in the same repository, and have written build steps to publish\nthem on the site.</p>\n<p>If you'd like to check out the code look\n<a href=\"https://github.com/aliceriot/site\">here</a>.</p>\n","date":"empty date"},"blog":{"title":"blog","body":"<h2>My blog</h2>\n<p>Some more or less random stuff about programming. Enjoy!</p>\n","date":"empty date"},"matasano":{"title":"matasano","body":"<h1>Matasano Exercises</h1>\n<p>These are my solutions to the CryptoPals series of cryptography problems.\nYou can find the orignal problems <a href=\"http://cryptopals.com/\">here</a>.</p>\n<p>I'm solving them here in Golang. I wrote a <a href=\"https://github.com/aliceriot/mark_set_go\">Ruby\ngem</a> to take a Go file and\ntransform it into valid Markdown, with all the source code formatted as\ncode blocks and all of the comment text as the body of the Markdown file.\nThis let's me write an explanation of the solution, using Markdown syntax,\nin comments in my source file, and then reformat the source code file into\nsomething suitable for display on the web.</p>\n<p>Probably I've made some errors here, if you notice any let me know!</p>\n<p>Happy crypto-ing!</p>\n","date":"empty date"}}